'''
Из шахматной доски по границам клеток выпилили связную 
(не распадающуюся на части) фигуру без дыр. 
Требуется определить ее периметр.
'''

# Для хранения клеток фигуры используем матрицу 8x8
board =[
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0]
]

# Входные данные:
# N - количество клеток в фигуре
N = int(input())

# Заполняем матрицу клетками фигуры
for _ in range(N):
    h, v = map(int, input().split())
    board[h-1][v-1] = 1

# Алгоритм:
perimeter = N * 4

# Периметр уменьшается на 2 за каждую смежную пару клеток
for i in range(7):
    for j in range(7):
        if board[i][j] == 1:
            if board[i][j+1] == 1:
                perimeter -= 2
            if board[i+1][j] == 1:
                perimeter -= 2

# Проверяем грани
for i in range(7):
    if board[7][i] == 1 and board[7][i+1] == 1:
        perimeter -= 2
    if board[i][7] == 1 and board[i+1][7] == 1:
        perimeter -= 2

# Выходные данные:
print(perimeter)
